## LeetCode ==> Second highest salary.

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'salary': [100, 100, 200, 300]
})

In [3]:
df

   id  salary
0   1     100
1   2     100
2   3     200
3   4     300

In [4]:
employee = df.salary.drop_duplicates().sort_values(ascending=False)

In [5]:
employee

3    300
2    200
0    100
Name: salary, dtype: int64

In [6]:
employee.iloc[2]

np.int64(100)

In [7]:
if len(employee) < 2:
    hv = None
else:
    hv = employee.iloc[1]

In [8]:
hv

np.int64(200)

### Department highest salary

In [35]:
employee_data = {
    'id': [1, 2, 3, 4, 5],
    'name': ['Joe', 'Jim', 'Henry', 'Sam', 'Max'],
    'salary': [70000, 90000, 80000, 60000, 90000],
    'departmentId': [1, 1, 2, 2, 1]
}

employee = pd.DataFrame(employee_data)

department_data = {
    'id': [1, 2],
    'name': ['IT', 'Sales']
}
department = pd.DataFrame(department_data)

In [36]:
employee

   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [37]:
employee.groupby("departmentId")["salary"].sum()

departmentId
1    250000
2    140000
Name: salary, dtype: int64

In [38]:
department

   id   name
0   1     IT
1   2  Sales

In [39]:
df = employee.merge(department,left_on="departmentId",right_on="id",suffixes=("_em","_de"))
df

   id_em name_em  salary  departmentId  id_de name_de
0      1     Joe   70000             1      1      IT
1      2     Jim   90000             1      1      IT
2      3   Henry   80000             2      2   Sales
3      4     Sam   60000             2      2   Sales
4      5     Max   90000             1      1      IT

In [40]:
max_salary = df.groupby("name_de")["salary"].agg(max)
max_salary.reset_index()

C:\Users\ShahriarHA\AppData\Local\Temp\ipykernel_10640\1307379054.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  max_salary = df.groupby("name_de")["salary"].agg(max)

  name_de  salary
0      IT   90000
1   Sales   80000

In [41]:
max_salary_re = max_salary.reset_index()
max_salary_re

  name_de  salary
0      IT   90000
1   Sales   80000

In [49]:
result = df.merge(max_salary_re,on=["name_de","salary"])
result

   id_em name_em  salary  departmentId  id_de name_de
0      2     Jim   90000             1      1      IT
1      3   Henry   80000             2      2   Sales
2      5     Max   90000             1      1      IT

In [50]:
result[["name_de","name_em","salary"]].set_axis(["Department","Employee","Salary"],axis=1)

  Department Employee  Salary
0         IT      Jim   90000
1      Sales    Henry   80000
2         IT      Max   90000